var departmemtdb = require('./models/departmemtdb');
var plandb = require('./models/plandb');
var mongoose = require("mongoose");

mongoose.connect("mongodb://localhost:27017/Budget_Management", {
  useUnifiedTopology: true,
  useNewUrlParser: true
});

var db = mongoose.connection;
var plan_info = new plandb();


var Academic_group  = new departmemtdb();
var budget_group  = new departmemtdb();
var person_group  = new departmemtdb();
var genaral_group  = new departmemtdb();

Academic_group.main = "กลุ่มบริหารงานวิชาการ";
Academic_group.sub = [
    "งานพัฒนาหลักสูตรสถานศึกษาและพัฒนากระบวนการเรียนรู้",
    "กลุ่มสาระการเรียนรู้ภาษาไทย",
    "กลุ่มสาระการเรียนรู้คณิตศาสตร์",
    "ห้องเรียนพิเศษวิทยาศาสตร์คณิตศาสตร์ เทคโนโลยีและสิ่งแวดล้อมระดับมัธยมศึกษาตอนต้น (SMTE)",
    "กลุ่มสาระการเรียนรู้วิทยาศาสตร์และเทคโนโลยี",
    "ห้องเรียนพิเศษวิทยาศาสตร์คณิตศาสตร์ เทคโนโลยีและสิ่งแวดล้อมระดับมัธยมศึกษาตอนปลาย (SMTE)",
    "กลุ่มสาระการเรียนรู้สังคมศึกษา ศาสนา และวัฒนธรรม",
    "ห้องเรียนพิเศษนิติศาสตร์ – รัฐศาสตร์",
    "กลุ่มสาระการเรียนรู้สุขศึกษาและพลศึกษา",
    "กลุ่มสาระการเรียนรู้ศิลปะ",
    "กลุ่มสาระการเรียนรู้ภาษาต่างประเทศ",
    "ภาษาต่างประเทศที่ 2",
    "ห้องเรียนพิเศษภาษาจีน – ญี่ปุ่น",
    "ห้องเรียนพิเศษตามโครงการจัดการเรียนการสอนตามหลักสูตรกระทรวงศึกษาธิการเป็นภาษาอังกฤษ (EP/MEP)",
    "กลุ่มสาระการเรียนรู้การงานอาชีพและเทคโนโลยี",
    "กิจกรรมพัฒนาผู้เรียน",
    "งานทะเบียน วัดและประเมินผล",
    "งานนิเทศการศึกษา",
    "งานพัฒนาสื่อ นวัตกรรมและเทคโนโลยี",
    "งานวิจัยเพื่อพัฒนาคุณภาพการศึกษา",
    "งานแนะแนวการศึกษา",
    "งานโรงเรียนมาตรฐานสากล",
    "งานโรงเรียนวิถีพุทธ",
    "งานโรงเรียนคุณภาพประจำตำบล",
    "งานโรงเรียนปรัชญาเศรษฐกิจพอเพียง",
    "ศูนย์พัฒนาการเรียนการสอนกลุ่มสาระการเรียนรู้ภาษาต่างประเทศ (ภาษาอังกฤษ) จังหวัดศรีสะเกษ",
    "งานศูนย์สะเต็มศึกษา",
    "งานศูนย์อบรมส่งเสริมโอลิมปิกวิชาการสอวน. คณิตศาสตร์"
]

budget_group.main = "กลุ่มบริหารงานงบประมาณและแผนงาน";
budget_group.sub = [
    "งานธุรการ",
    "งานการเงินและบัญชี",
    "งานพัสดุและสินทรัพย์",
    "งานแผนงานและงบประมาณ",
    "งานพัฒนาระบบประกันคุณภาพภายในสถานศึกษา",
    "งานสารสนเทศโรงเรียน",
    "งานสำนักงานเลขานุการผู้อำนวยการ",
    "งานระดมทรัพยากรเพื่อการศึกษา"
];

person_group.main = "กลุ่มบริหารงานบุคคล";
person_group.sub = [
    "งานกิจการนักเรียน",
    "งานระดับชั้น",
    "งานคณะสี",
    "งานส่งเสริมพัฒนาความประพฤติและระเบียบวินัย",
    "งานส่งเสริมคุณธรรม จริยธรรม",
    "งานระบบการดูแลช่วยเหลือนักเรียน",
    "งานส่งเสริมประชาธิปไตย",
    "งานสถานศึกษาสีขาว",
    "งานโรงเรียนสุจริต",
    "งานประกันอุบัติเหตุ",
    "งานบุคลากร",
    "งานวางแผนอัตรากำลังและกำหนดตำแหน่ง",
    "งานสรรหาและการบรรจุแต่งตั้ง",
    "งานเสริมสร้างประสิทธิภาพในการปฏิบัติราชการ",
    "งานวินัยและการรักษาวินัย",
    "งานการออกจากราชการ",
    "งานรักษาความปลอดภัย",
    "งานศูนย์พัฒนาศักยภาพบุคคลเพื่อความเป็นเลิศ (Human Capital Excellence Center : HCEC)"
];

genaral_group.main = "กลุ่มบริหารงานทั่วไป";
genaral_group.sub = [
    "งานอาคารสถานที่และแหล่งเรียนรู้",
    "งานประชาสัมพันธ์",
    "งานอนามัยโรงเรียน",
    "งานห้องสมุด",
    "งานสหกรณ์เพื่อการศึกษา",
    "งานสวัสดิการ กองทุน และมูลนิธิ",
    "งานโสตทัศนศึกษา",
    "งานโรงเรียนกับชุมชนและภาคีเครือข่าย",
    "งานโภชนาการและศูนย์อาหาร",
    "งานศูนย์สิ่งแวดล้อมศึกษา จังหวัดศรีสะเกษ",
    "งานยานพาหนะ",
    "งานธนาคารโรงเรียน",
    "งานพัฒนาระบบเทคโนโลยีสารสนเทศและเครือข่าย"
];


//-------------------------------------------------------------------------------------------------


plan_info.contry_statigy = [
    "ด้านความมั่นคง",
    "ด้านการสร้างความสามารถในการแข่งขัน",
    "ด้านการพัฒนาและเสริมสร้างศักยภาพคน",
    "ด้านการสร้างโอกาสความเสมอภาคและเท่าเทียมกันทางสังคม",
    "ด้านการสร้างการเติบโตบนคุณภาพชีวิตที่เป็นมิตรกับสิ่งแวดล้อม",
    "ด้านการปรับสมดุลและพัฒนาระบบการบริหารจัดการภาครัฐ"
];
plan_info.spt_statigy = [
    "การจัดการศึกษาเพื่อความมั่นคง",
    "พัฒนาคุณภาพผู้เรียน และส่งเสริมการจัดการศึกษาเพื่อสร้างขีดความสามารถในการแข่งขัน",
    "ส่งเสริมพัฒนาครูและบุคลากรทางการศึกษา",
    "ขยายโอกาสการเข้าถึงทางการศึกษาและการเรียนรู้อย่างมีคุณภาพ",
    "จัดการศึกษาเพื่อเสริมสร้างคุณภาพชีวิตที่เป็นมิตรกับสิ่งแวดล้อม",
    "พัฒนาระบบการบริหารจัดการและส่งเสริมให้ทุกภาคส่วนมีส่วนร่วม"
];
plan_info.shool_standard = [
    "คุณภาพของผู้เรียน",
    "กระบวนการบริหารและการจัดการของผู้บริหารสถานศึกษา",
    "กระบวนการจัดการเรียนการสอนที่เน้นผู้เรียนเป็นสำคัญ"
];
plan_info.indicator = [
    "ผู้เรียนมีทักษะการอ่าน เขียน สื่อสารภาษาไทย ภาษาอังกฤษ ภาษาต่างประเทศที่ 2 และความสามารถในการคิดคำนวณตามเกณฑ์ของแต่ละระดับชั้น",
    "ผู้เรียนมีทักษะการการคิดวิเคราะห์ คิดอย่างมีวิจารณญาณ แลกเปลี่ยนเรียนรู้  สร้างองค์ความรู้ สู่กระบวนการแก้ปัญหา เกิดความคิดเชิงสร้างสรรค์ พัฒนานวัตกรรมใช้ในแก้ปัญหาการดำเนินชีวิตและดำรงชีวิตในชุมชนท้องถิ่น",
    "ผู้เรียนมีผลงานเชิงนวัตกรรมในสาขาวิชาชีพตามแผนการเรียนที่นำไปใช้ได้จริงกับกลุ่มปัญหาตรงตามความต้องการในชุมชน",
    "ผู้เรียนรู้เท่าทันสื่อเทคโนโลยี   มีจริยธรรมและทักษะการใช้สื่อเทคโนโลยีสารสนเทศ ในการเข้าถึงองค์ความรู้ เพื่อการเรียนรู้ การสื่อสารและการดำเนินวิถีชีวิต",
    "ผู้เรียนมีผลสัมฤทธิ์ทางการเรียน ระดับดีขึ้นไปเพิ่มขึ้นร้อยละ ๓ และคะแนนเฉลี่ยผลการสอบวัดระดับชาติ O - NET ระดับ ม.๓ และม.๖ ในสาระการเรียนรู้หลักสูงกว่าระดับประเทศ",
    "ผู้เรียนมีทักษะพื้นฐาน และเจตคติที่ดีต่อการประกอบอาชีพ",
    "ผู้เรียนมีคุณลักษณะอันพึงประสงค์และค่านิยม ๑๒ ประการ ตามที่สถานศึกษากำหนด โดยไม่ขัด กับกฎหมายและวัฒนธรรมอันดีของสังคม",
    "ผู้เรียนมีส่วนร่วมในการอนุรักษ์ทรัพยากรธรรมชาติและสิ่งแวดล้อม อย่างเป็นรูปธรรมและมีความภาคภูมิใจในท้องถิ่น ความเป็นไทย และเห็นคุณค่าเกี่ยวกับภูมิปัญญาไทยและแสดงออกได้อย่างเหมาะสมในชีวิตประจำวัน",
    "ผู้เรียนมีทักษะการปรับตัวและเท่าทันต่อการเปลี่ยนแปลงของสังคมโลกและมีเป้าหมายการเรียนรู้สร้างเป้าหมายชีวิตการทำงานและการประกอบอาชีพ",
    "ผู้เรียนมีพัฒนาการทางด้านร่างกาย จิตใจ มีสุนทรียภาพ และสามารถป้องกันตนเองจากภัยสังคม",
    "โรงเรียนมีเอกลักษณ์ความเป็นเลิศ วิสัยทัศน์ พันธกิจ เป้าประสงค์ กลยุทธ์ ที่รองรับนโยบายกระทรวงศึกษาธิการ นโยบายประเทศ",
    "โรงเรียนมีระบบการบริหารจัดการคุณภาพ ประสิทธิภาพและประสิทธิผล",
    "โรงเรียนมีหลักสูตรสถานศึกษาที่รองรับกลุ่มศักยภาพผู้เรียนที่หลากหลายและสอดคล้องกับความต้องการของท้องถิ่น",
    "โรงเรียนให้บริการแนะแนวการศึกษา แนะแนวอาชีพ แนะแนวทักษะชีวิต จัดทำระเบียนสะสมและแฟ้มสะสมผลงาน ที่แสดงเส้นทางการศึกษาต่อสู่การประกอบอาชีพ (Career Path และ Portfolios)",
    "โรงเรียนมีแผนการพัฒนาสมรรถนะวิชาชีพครู และมีบันทึกข้อมูลผลงานเชิงประจักษ์ที่เป็นไปตามมาตรฐานการปฏิบัติงานรายปี",
    "ครูมีจรรยาบรรณวิชาชีพครูและมีแผนการพัฒนาศักยภาพการพัฒนาวิชาชีพครูเป็นรายบุคคล รองรับการจัดกิจกรรมการเรียนรู้ในศตวรรษที่ 21",
    "โรงเรียนมีสิ่งอำนวยความสะดวก สภาพแวดล้อม แหล่งเรียนรู้ตามศาสตร์ของพระราชา",
    "โรงเรียนจัดระบบเทคโนโลยี สนับสนุนการจัดกิจกรรมการเรียนรู้อย่างมีประสิทธิภาพ",
    "โรงเรียนมีระบบบริหารข้อมูลสารสนเทศที่เป็นปัจจุบัน  เพื่อการบริหารและการจัดการเรียนรู้ ที่แสดงความเชื่อมโยงสอดคล้องขององค์กร ทั้งภายในและภายนอกโรงเรียน",
    "ครูจัดกิจกรรมการเรียนรู้เป็นไปตามกระบวนการ Active Learning ที่สร้างโอกาสให้ผู้เรียนทุกคนมีส่วนร่วมคิดและปฏิบัติ ตามความถนัดและความสนใจ",
    "ครูจัดกิจกรรมการเรียนรู้โดยให้ผู้เรียนฝึกเป็นผู้ประกอบการ และทำธุรกิจพอเพียง ตามกระบวนการ Project-based Learning",
    "ครูมีทักษะการใช้สื่อเทคโนโลยีที่แสดงการใช้ตามแผนการจัดกิจกรรมการเรียนรู้ ",
    "ครูบริหารจัดการชั้นเรียนเชิงบวก",
    "ครูตรวจสอบและประเมินผู้เรียนอย่างเป็นระบบ มีประสิทธิภาพ โดยใช้เครื่องมือวัดและประเมินผลที่เหมาะสมกับกลุ่มเป้าหมายในการจัดกิจกรรมการเรียนรู้ตามมาตรฐานการเรียนรู้",
    "ครูมีการจัดกิจกรรมแลกเปลี่ยนเรียนรู้ บูรณาการร่วมกับกลุ่มสาระการเรียนรู้ในระดับชั้นเดียวกันและบูรณาการกับแหล่งเรียนรู้ สถานประกอบการกลุ่มอาชีพอิสระของชุมชนท้องถิ่น",
    "ครูบันทึกผลการเรียนรู้และวิจัยในชั้นเรียนที่เป็นไปตามเกณฑ์ของตัวชี้วัดรายวิชา ในแต่ละกลุ่มศักยภาพของผู้เรียนที่นำผลย้อนกลับไปปรับปรุงพัฒนาผู้เรียนเป็นรายบุคคล"
    
];
plan_info.target = [
    "ร้อยละของผู้เรียนที่มีทักษะการ อ่าน เขียน สื่อสารภาษาไทย ภาษาอังกฤษภาษาต่างประเทศที่ 2 และความสามารถในการคิดคำนวณตามเกณฑ์ของแต่ละระดับชั้นตั้งแต่ระดับดีขึ้นไปโดย ผู้เรียนร้อยละ 98 มีทักษะการอ่าน เขียน ภาษาไทย และสื่อสารภาษาไทย (100),ผู้เรียนร้อยละ 80 มีทักษะการสื่อสารภาษาอังกฤษ,ผู้เรียนร้อยละ 76 มีทักษะการสื่อสารภาษาต่างประเทศที่ 2,ผู้เรียนร้อยละ 80 มีความสามารถในการคิดคำนวณ ",
    "ผู้เรียนร้อยละ 90 ปฏิบัติกิจกรรมตามกระบวนการ Active learning พัฒนานวัตกรรม ใช้แก้ปัญหาการดำเนินชีวิตดำรงชีวิตในชุมชนท้องถิ่น",
    "ผู้เรียนร้อยละ 90 มีผลงานเชิงนวัตกรรมในสาขาวิชาชีพตามแผนการเรียนที่นำไปใช้ได้จริงกับกลุ่มปัญหาตรงตามความต้องการในชุมชน",
    "ผู้เรียนร้อยละ 95 รู้เท่าทันสื่อเทคโนโลยี มีจริยธรรมและทักษะการใช้สื่อเทคโนโลยีสารสนเทศ ในการเข้าถึงองค์ความรู้ เพื่อการเรียนรู้ การสื่อสารและการดำเนินวิถีชีวิต",
    "ผู้เรียนร้อยละ 76 มีผลสัมฤทธิ์ทางการเรียนตั้งแต่ระดับดีขึ้นไป",
    "คะแนนเฉลี่ยผลการสอบวัดระดับชาติ O-NET ระดับ ม.3 และ ม.6 ในสาระการเรียนรู้หลักสูงกว่าระดับประเทศ (ระดับคุณภาพดีเลิศ)",
    "ผู้เรียนร้อยละ 90 มีทักษะพื้นฐาน และเจตคติที่ดีต่อการประกอบอาชีพ",
    "ผู้เรียนร้อยละ 100 มีคุณลักษณะอันพึงประสงค์",
    "ผู้เรียนร้อยละ 100 มีค่านิยม 12 ประการ ตามที่สถานศึกษากำหนด โดยไม่ขัดกับกฎหมายและวัฒนธรรมอันดีของสังคม",
    "ผู้เรียนร้อยละ 95 มีส่วนร่วมในการอนุรักษ์ทรัพยากรธรรมชาติและสิ่งแวดล้อม อย่างเป็นรูปธรรม",
    "ผู้เรียนร้อยละ 95 มีส่วนร่วมในกิจกรรมส่งเสริมประเพณี ศิลปวัฒนธรรมท้องถิ่น",
    "ผู้เรียนร้อยละ 90 มีทักษะการปรับตัวและเท่าทันต่อการเปลี่ยนแปลงของสังคมโลกและมีเป้าหมายการเรียนรู้สร้างเป้าหมายชีวิตการงานและการประกอบอาชีพ",
    "ผู้เรียนร้อยละ 98 มีน้ำหนักส่วนสูง และสมรรถภาพทางกายตามเกณฑ์มาตรฐาน",
    "ผู้เรียนร้อยละ 98 มีความฉลาดทางด้านอารมณ์ อยู่ในเกณฑ์ปกติ",
    "ผู้เรียนร้อยละ 95 มีสุนทรียภาพทางด้านศิลปะ ดนตรีนาฏศิลป์กีฬา นันทนาการ ตามจินตนาการ",
    "ผู้เรียนร้อยละ 95 สามารถป้องกันตนเองจากสิ่งเสพติดให้โทษและอบายมุขหลีกเลี่ยงตนเองจากสภาวะที่เสี่ยงต่อความรุนแรง ปัญหาทางเพศ",
    "โรงเรียนมีเอกลักษณ์ความเป็นเลิศ ที่นำไปสู่การกำหนด วิสัยทัศน์พันธกิจ เป้าประสงค์ ที่รองรับนโยบายกระทรวงศึกษาธิการ นโยบายประเทศและนำไปสู่การปฏิบัติ (ระดับคุณภาพยอดเยี่ยม)",
    "โรงเรียนใช้ระบบประกันคุณภาพภายในเพื่อยกระดับคุณภาพการจัดการศึกษาอย่างมีประสิทธิภาพ (ระดับคุณภาพยอดเยี่ยม)",
    "ระบบการนิเทศ กำกับ ติดตาม ที่แสดงถึงความก้าวหน้าของพันธกิจ และเป้าประสงค์การเป็นโรงเรียนมาตรฐานสากลและมัธยมศึกษา 4.0 บนพื้นฐานเศรษฐกิจพอเพียง (ระดับคุณภาพยอดเยี่ยม)",
    "จำนวนโครงการที่มีการรายงานผลการดำเนินงาน โครงการ กิจกรรม ตามรูปแบบการรายงานโครงการถูกต้องครบถ้วน ที่ระบุไว้ในแผนปฏิบัติการประจำปี (ระดับคุณภาพยอดเยี่ยม)",
    "ระดับความพึงพอใจต่อระบบการบริหารจัดการคุณภาพการศึกษาของโรงเรียน  (ระดับคุณภาพยอดเยี่ยม)",
    "ระดับความพึงพอใจของบุคคลหน่วยงาน ชุมชน ท้องถิ่น ที่มีต่อการให้บริการของโรงเรียน (ระดับคุณภาพยอดเยี่ยม)",
    "โรงเรียนมีสารสนเทศที่แสดงถึงความต้องการของผู้เรียน และมีโครงสร้างการเรียนที่รองรับกลุ่มศักยภาพผู้เรียนที่หลากหลายและสอดคล้องกับความต้องการของท้องถิ่น (ระดับคุณภาพยอดเยี่ยม)",
    "โรงเรียนมีหลักสูตรสถานศึกษาที่มีโครงสร้างการเรียนที่รองรับกลุ่มศักยภาพผู้เรียนอย่างหลากหลายและดำเนินการอย่างเป็นระบบ (ระดับคุณภาพยอดเยี่ยม)",
    "โรงเรียนมีสารสนเทศที่แสดงถึงความต้องการของผู้เรียน และมีโครงสร้างการเรียนที่รองรับกลุ่มศักยภาพผู้เรียนที่หลากหลายและสอดคล้องกับความต้องการของท้องถิ่น (ระดับคุณภาพยอดเยี่ยม)",
    "โรงเรียนมีหลักสูตรสถานศึกษาที่มีโครงสร้างการเรียนที่รองรับกลุ่มศักยภาพผู้เรียนอย่างหลากหลายและดำเนินการอย่างเป็นระบบ (ระดับคุณภาพยอดเยี่ยม)",
    "ระดับประสิทธิภาพของการบริการแนะแนวการศึกษา อาชีพ และทักษะชีวิต (ระดับคุณภาพยอดเยี่ยม)",
    "ผู้เรียนร้อยละ 100 มีระเบียนสะสมและแฟ้มสะสมผลงาน ที่แสดงเส้นทางการศึกษาต่อ สู่การประกอบอาชีพ (Career Path และ Portfolios)",
    "ครูและบุคลากรร้อยละ100 ได้รับการพัฒนาผ่านกระบวนการชุมชนแห่งการเรียนรู้ทางวิชาชีพ (PLC) สอดคล้องกับความต้องการรายบุคคลและมีบันทึกข้อมูลผลงานเชิงประจักษ์ที่เป็นไปตามมาตรฐานการปฏิบัติงานรายปี",
    "ครูร้อยละ 100 มีจรรยาบรรณวิชาชีพครูและมีแผนการพัฒนาศักยภาพ การพัฒนาวิชาชีพครูเป็นรายบุคคลรองรับการจัดกิจกรรมการเรียนรู้ในศตวรรษที่ 21",
    "โรงเรียนมีแผนการบริหารจัดการสิ่งอำนวยความสะดวก สภาพแวดล้อม แหล่งเรียนรู้ตามศาสตร์ของพระราชาและเอื้อต่อการจัดการเรียนรู้อย่างมีคุณภาพ  (ระดับคุณภาพยอดเยี่ยม)",
    "ระดับความพึงพอใจของผู้รับบริการที่มีต่อการจัดสภาพแวดล้อมทางกายภาพที่เอื้อต่อการจัดการเรียนการสอน (ระดับคุณภาพยอดเยี่ยม)",
    "โรงเรียนมีสิ่งอำนวยความสะดวก สภาพแวดล้อม แหล่งเรียนรู้ตามศาสตร์ของพระราชา(ระดับคุณภาพยอดเยี่ยม)",
    "โรงเรียนมีห้องปฏิบัติการ ห้องสืบค้นความรู้ที่นำระบบเทคโนโลยีการเข้าถึงความรู้ แหล่งเรียนรู้ และบรรยากาศที่เอื้อต่อการเรียนรู้ครบทุกกลุ่มสาระการเรียนรู้ (ระดับคุณภาพยอดเยี่ยม)",
    "ครูร้อยละ 100 ใช้เทคโนโลยี ในการจัดการเรียนรู้",
    "ระดับความพึงพอใจของผู้รับบริการที่มีต่อการจัดระบบเทคโนโลยี (ระดับคุณภาพยอดเยี่ยม)",
    "โรงเรียนมีระบบบริหารข้อมูลสารสนเทศที่เป็นปัจจุบัน  เพื่อการบริหารและการจัดการเรียนรู้ที่แสดงความเชื่อมโยงสอดคล้องขององค์กร ทั้งภายในและภายนอกโรงเรียน (ระดับคุณภาพยอดเยี่ยม)",
    "ผู้เรียนร้อยละ 90 มีส่วนร่วมในการวิเคราะห์ตนเอง กำหนดเนื้อหาสาระกิจกรรมการเรียนรู้ตามกระบวนการ Active Learning ตามความสนใจและความถนัดเป็นรายบุคคลอย่างเป็นรูปธรรมทั้งระบบ",
    "ผู้เรียนร้อยละ 83 ได้เรียนรู้ โดยผ่านกระบวนการคิดและปฏิบัติ ด้วยวิธีการและแหล่งเรียนรู้ที่หลากหลาย สรุปองค์ความรู้และสามารถนำไปใช้ในสถานการณ์ต่างๆ ได้เป็นอย่างดี",
    "ผู้เรียนร้อยละ 83 ได้เรียนรู้โดยเชื่อมโยงบูรณาการสาระการเรียนรู้และทักษะด้านต่างๆ",
    "ผู้เรียนร้อยละ 83 มีส่วนร่วมในการจัดบรรยากาศสภาพแวดล้อมสื่อการเรียนและอำนวยความสะดวกที่เอื้อต่อการเรียนรู้",
    "ผู้เรียนร้อยละ 83 เรียนรู้โดยใช้กระบวนการวิจัยอย่างเป็นรูปธรรมและต่อเนื่อง",
    "ครูร้อยละ 90 มีการจัดกิจกรรมการเรียนรู้  ให้ผู้เรียนฝึกเป็นผู้ประกอบการ และทำธุรกิจพอเพียง ตามกระบวนการ Project-based Learning",
    "ครูร้อยละ 90 มีทักษะการใช้สื่อเทคโนโลยี ที่แสดงการใช้ตามแผนการจัดกิจกรรมการเรียนรู้และมีการบันทึกการใช้สื่อเป็นเชิงประจักษ์",
    "ระดับความพึงพอใจต่อการบริหารจัดการชั้นเรียนเชิงบวกของครูผู้สอน (ระดับคุณภาพยอดเยี่ยม)",
    "ครูร้อยละ 82 ที่ประเมินเรียนจากสภาพจริง",
    "ครูร้อยละ 82 มีขั้นตอนตรวจสอบและประเมินความรู้ความเข้าใจของผู้เรียนอย่างเป็นระบบ",
    "ผู้เรียนร้อยละ 90 และผู้มีส่วนเกี่ยวข้องมีส่วนร่วมในการวัดและประเมินผล",
    "ครูร้อยละ 90 ที่มีเครื่องมือวัดผลการพัฒนาพฤติกรรมการเรียนรู้ได้ตรงตามสภาพจริงอย่างสมดุลเชิงคุณภาพและอิงมาตรฐานการเรียนรู้รายวิชาและตัวชี้วัด",
    "ครูร้อยละ 87 จัดกิจกรรมการเรียนรู้บูรณาการร่วมกับกลุ่มสาระการเรียนรู้ในระดับชั้นเดียวกัน",
    "ผู้เรียนร้อยละ 85 ได้เรียนรู้จากแหล่งเรียนรู้และภูมิปัญญาท้องถิ่น สถานประกอบการกลุ่มอาชีพอิสระของชุมชนท้องถิ่น",
    "ชุมชนร้อยละ 83 มีส่วนร่วมแสดงความคิดเห็นหรือร่วมจัดกิจกรรมการเรียนการสอนอย่างเป็น",
    "ครูร้อยละ 93 มีการบันทึกผลการเรียนรู้และวิจัยในชั้นเรียนที่แสดงศักยภาพด้านความรู้ ทักษะและคุณลักษณะอันพึงประสงค์ ที่เป็นไปตามเกณฑ์ของตัวชี้วัดรายวิชาในแต่ละกลุ่มศักยภาพของผู้เรียนที่นำผลย้อนกลับไปปรับปรุงพัฒนาผู้เรียนเป็นรายบุคคล",

];
plan_info.school__statigy = [
    "พัฒนาผู้เรียนให้เป็นพลโลกแห่งศตวรรษที่ 21 ",
    "พัฒนาศักยภาพและจรรยาบรรณทางวิชาชีพครู",
    "ส่งเสริมและพัฒนาหลักสูตรสถานศึกษาตามกลุ่มศักยภาพผู้เรียน",
    "พัฒนาศักยภาพระบบการกำกับและสะท้อนผลมาตรฐานคุณภาพการบริหารจัดการ",
    "ส่งเสริมพัฒนาภาคีเครือข่าย ความร่วมมือการพัฒนากิจกรรมการเรียนรู้ตามศาสตร์พระราชา"
];
plan_info.main_project_school = [
    "พัฒนาผู้เรียนให้มีทักษะการเรียนรู้แห่งศตวรรษที่ 21",
    "พัฒนาระเบียบวินัยส่งเสริมคุณธรรม จริยธรรม และคุณลักษณะอันพึงประสงค์",
    "ยกระดับผลสัมฤทธิ์ทางการเรียน",
    "พัฒนาครูสู่ความเป็นครูในศตวรรษที่ 21",
    "พัฒนาศักยภาพครู",
    "พัฒนาหลักสูตรสถานศึกษา",
    "พัฒนาสื่อและแหล่งเรียนรู้",
    "พัฒนาระบบบริหารงานด้วยระบบคุณภาพ",
    "พัฒนาสมรรถนะครู",
    "พัฒนาสมรรถนะครูเสริมสร้างความสัมพันธ์ระหว่างโรงเรียนกับชุมชน"
];
plan_info.main_activities = [
    "ส่งเสริมการบูรณาการในวิชาโครงงาน สะเต็ม ค่ายวิชาการ ค่ายทักษะชีวิต วิชาศึกษาค้นคว้าอิสระ และสร้างองค์ความรู้ เพื่อกระบวนการแก้ปัญหา เกิดความคิดเชิงสร้างสรรค์ ผลิตนวัตกรรมใช้แก้ปัญหาการดำเนินและดำรงชีวิตในชุมชน",
    "ส่งเสริมคุณลักษะอันพึงประสงค์ ค่านิยมที่ดีตามที่สถานศึกษากำหนด ศึกษาแหล่งเรียนรู้และสถานประกอบการ ตลาดนัดวิชาการและวิชาชีพ เปิดโลกกว้างทางการศึกษา และส่งเสริมการหารายได้ระหว่างเรียน",
    "ส่งเสริมพัฒนาการผู้เรียนทางด้านร่างกายจิตใจและสติปัญญา มีความรู้เท่าทันสื่อเทคโนโลยีและสารสนเทศ",
    "ส่งเสริมผู้เรียนให้มีคุณลักษณะในศตวรรษที่ 21",
    "ส่งเสริมกิจกรรมการเรียนรู้ทางภาษา การสื่อสาร และความสามารถด้านการคิดคำนวณ",
    "ส่งเสริมให้ผู้เรียนได้แสดงผลงานนวัตกรรมผ่านการนำเสนอผลลัพธ์บนเวทีศักยภาพ ตามความต้องการของตนเองและชุมชน",
    "ส่งเสริมทักษะการประกอบอาชีพตามหลักเศรษฐกิจ พอเพียงสู่ชุมชน",
    "ส่งเสริมผู้เรียนให้มีส่วนร่วมอนุรักษ์สิ่งแวดล้อม ปลูกจิตสำนึก รักบ้านเกิด อนุรักษ์ความเป็นไทย",
    "ส่งเสริมระเบียบวินัย คุณธรรม จริยธรรมความรับผิดชอบต่อสังคมส่วนรวมบนพื้นฐานของความเป็นประชาธิปไตย",
    "ยกระดับผลสัมฤทธิ์ทางการเรียน",
    "กิจกรรมการเรียนรู้ตามกระบวนการ Active Learning",
    "การจัดการเรียนรู้เพื่อส่งเสริมคุณลักษณะของผู้เรียนในศตวรรษที่ 21",
    "การบริหารจัดการชั้นเรียนเชิงบวก",
    "พัฒนาครูให้มีทักษะการใช้สื่ออย่างมีประสิทธิภาพ",
    "กิจกรรมการเรียนรู้บูรณาการเพื่อฝึกทักษะการเป็นผู้ประกอบการ",
    "พัฒนาการสร้างเครื่องมือ รูปแบบ วิธีการวัดและประเมินผลอย่างมีคุณภาพ",
    "ส่งเสริมการวิจัยเพื่อแก้ปัญหาในชั้นเรียน",
    "ส่งเสริมและสนับสนุนให้ครูได้พัฒนาตนเองตามคุณลักษณะครูในศตวรรษที่ 21",
    "พัฒนาหลักสูตรสถานศึกษา",
    "พัฒนาระบบงานแนะแนวตามหลักสูตรสถานศึกษา",
    "พัฒนาแหล่งเรียนรู้โดยใช้ระบบเทคโนโลยีเพื่อให้เข้าถึงความรู้ และสร้างบรรยากาศที่เอื้อต่อการเรียนรู้",
    "พัฒนาแหล่งเรียนรู้ตามศาสตร์พระราชาสู่การพัฒนาอย่างยั่งยืน",
    "พัฒนาระบบเครือข่ายเพื่อรองรับการจัดกิจกรรมการเรียนการสอน",
    "พัฒนาระบบสารสนเทศ ให้ถูกต้องและเป็นปัจจุบัน ที่เชื่อมโยงขององค์กรทั้งภายในและภายนอก",
    "พัฒนาระบบกำกับ ติดตามงานตามโครงสร้างของโรงเรียน ให้ดำเนินงานภายใต้กลยุทธ์เพื่อให้บรรลุวิสัยทัศน์ พันธกิจ และเป้าประสงค์",
    "พัฒนาระบบสารสนเทศ เพื่อการกำกับติดตามความก้าวหน้าของโครงการ กิจกรรมตามแผนปฏิบัติการ",
    "พัฒนาระบบนิเทศ กำกับติดตาม ทบทวนผลการดำเนินงาน นำเสนอผลการบริหารจัดการด้วยระบบคุณภาพ",
    "พัฒนาระบบบริหารงานด้ายระบบคุณภาพ",
    "ส่งเสริมและพัฒนาระบบประกันคุณภาพการศึกษา เพื่อยกระดับคุณภาพการจัดการศึกษาอย่างมีประสิทธิภาพ",
    "ส่งเสริมและสนับสนุนความก้าวหน้าทางวิชาชีพครู พัฒนาสมรรถนะครู ที่เป็นไปตามมาตรฐานการปฏิบัติงานรายปี",
    "ประสานสัมพันธ์ ขอความร่วมมือผู้มีส่วนเกี่ยวข้อง ร่วมกำหนดความต้องการ การจัดการศึกษาและเป็นพี่เลี้ยงในการพัฒนาการเรียนการสอน"
];

//-------------------------------------------------------------------------------------------------

Academic_group.save(function(err){
    if (err)
        throw err;
})
budget_group.save(function(err){
    if (err)
        throw err;
})
person_group.save(function(err){
    if (err)
        throw err;
})
genaral_group.save(function(err){
    if (err)
        throw err;
})
plan_info.save(function(err){
    if (err)
        throw err;
})

console.log("Complete ...");
db.close();